app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_id]
      artist = Artist.includes(:songs).find_by(id: params[:artist_id])
      if artist.nil?
        flash[:alert] = "Artist not found"
        redirect_to artists_path
      else
        @songs = artist.songs
      end
    else
      @songs = Song.all

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
    # Ideally, I would prefer to redirect to the songs index when any invalid song id is
    # passed, but that's not what the spec calls for here

    @song = Song.find_by(id: params[:id])
    artist = params[:artist_id] ? Artist.find_by(id: params[:artist_id]) : nil